# ComboBoxDropDownClosedEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComboBoxDropDownClosedEventArgs Class
Members See Also
---
The event arguments used by ComboBox's DropDownClosed event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ComboBoxDropDownClosedEventArgs : RibbonItemEventArgs
```

Visual Basic
---
```text
Public Class ComboBoxDropDownClosedEventArgs _
	Inherits RibbonItemEventArgs
```

Visual C++
---
```text
public ref class ComboBoxDropDownClosedEventArgs : public RibbonItemEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.UI.Events..::..RibbonItemEventArgs Autodesk.Revit.UI.Events..::..ComboBoxDropDownClosedEventArgs
# See Also
ComboBoxDropDownClosedEventArgs Members
Autodesk.Revit.UI.Events Namespace